app/controllers/activations_controller.rb

  def new
    @user = User.find_using_perishable_token(params[:activation_code], 1.week) || (raise Exception)
---
SELECT `users`.* FROM `users` WHERE (perishable_token = 'ccsKPeTPxD5U2bKwKNh' and updated_at > '2010-12-09 18:27:46') LIMIT 1

  def create
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 2) LIMIT 1