app/controllers/videos_controller.rb

  def index
    @videos = Video.find :all
---
SELECT `videos`.* FROM `videos`

  def create
    @video = Video.new(params[:video])
    @video.user = current_user
    if @video.save
---
INSERT INTO `videos` (`created_at`, `description`, `source_content_type`, `source_file_name`, `source_file_size`, `state`, `thumbnail_id`, `title`, `updated_at`, `uploaded_data`, `user_id`) VALUES ('2010-12-17 20:56:23', 'test', NULL, NULL, NULL, 'pending', NULL, 'test', '2010-12-17 20:56:23', '#<File:0x16158b8>', NULL)

  def show
    @video = Video.find(params[:id])
---
SELECT `videos`.* FROM `videos` WHERE (`videos`.`id` = 1) LIMIT 1